In [2]:
import pandas as pd

In [3]:
import numpy as np

In [4]:
py2014 = pd.Series([100,99.3,95.5,93.5,92.4,84.8,84.5,78.9,74.3,72.8],
                    index=['Java','C','C++','Python','C#','PHP','JavaScript','Ruby','R','Matlab'])
py2015 = pd.Series({'Java': 100,'C': 99.9,'C++': 99.4,'Python': 96.5,'C#': 91.3,
                     'R': 84.8,'PHP': 84.5,'JavaScript': 83.0,'Ruby': 76.2,'Matlab': 72.4})

In [5]:
py2014

Java          100.0
C              99.3
C++            95.5
Python         93.5
C#             92.4
PHP            84.8
JavaScript     84.5
Ruby           78.9
R              74.3
Matlab         72.8
dtype: float64

In [6]:
py2015

Java          100.0
C              99.9
C++            99.4
Python         96.5
C#             91.3
R              84.8
PHP            84.5
JavaScript     83.0
Ruby           76.2
Matlab         72.4
dtype: float64

In [7]:
twoyear = pd.DataFrame({'2014':py2014, '2015':py2015})

In [8]:
twoyear

             2014   2015
C            99.3   99.9
C#           92.4   91.3
C++          95.5   99.4
Java        100.0  100.0
JavaScript   84.5   83.0
Matlab       72.8   72.4
PHP          84.8   84.5
Python       93.5   96.5
R            74.3   84.8
Ruby         78.9   76.2

In [9]:
twoyear.head()

             2014   2015
C            99.3   99.9
C#           92.4   91.3
C++          95.5   99.4
Java        100.0  100.0
JavaScript   84.5   83.0

In [10]:
twoyear.values

array([[ 99.3,  99.9],
       [ 92.4,  91.3],
       [ 95.5,  99.4],
       [100. , 100. ],
       [ 84.5,  83. ],
       [ 72.8,  72.4],
       [ 84.8,  84.5],
       [ 93.5,  96.5],
       [ 74.3,  84.8],
       [ 78.9,  76.2]])

In [11]:
twoyear.index

Index(['C', 'C#', 'C++', 'Java', 'JavaScript', 'Matlab', 'PHP', 'Python', 'R',
       'Ruby'],
      dtype='object')

In [12]:
twoyear['2014']

C              99.3
C#             92.4
C++            95.5
Java          100.0
JavaScript     84.5
Matlab         72.8
PHP            84.8
Python         93.5
R              74.3
Ruby           78.9
Name: 2014, dtype: float64

In [14]:
twoyear.

SyntaxError: invalid syntax (<ipython-input-14-857dd25d1f1a>, line 1)

In [15]:
twoyearcopy = pd.DataFrame({'Y2014':py2014, 'Y2015':py2015})

In [17]:
twoyearcopy

            Y2014  Y2015
C            99.3   99.9
C#           92.4   91.3
C++          95.5   99.4
Java        100.0  100.0
JavaScript   84.5   83.0
Matlab       72.8   72.4
PHP          84.8   84.5
Python       93.5   96.5
R            74.3   84.8
Ruby         78.9   76.2

In [18]:
twoyearcopy['Y2014']

C              99.3
C#             92.4
C++            95.5
Java          100.0
JavaScript     84.5
Matlab         72.8
PHP            84.8
Python         93.5
R              74.3
Ruby           78.9
Name: Y2014, dtype: float64

In [19]:
twoyearcopy.Y2014

C              99.3
C#             92.4
C++            95.5
Java          100.0
JavaScript     84.5
Matlab         72.8
PHP            84.8
Python         93.5
R              74.3
Ruby           78.9
Name: Y2014, dtype: float64

In [24]:
twoyear.keys()

Index(['2014', '2015'], dtype='object')

In [22]:
twoyear.columns

Index(['2014', '2015'], dtype='object')

In [28]:
twoyear

             2014   2015
C            99.3   99.9
C#           92.4   91.3
C++          95.5   99.4
Java        100.0  100.0
JavaScript   84.5   83.0
Matlab       72.8   72.4
PHP          84.8   84.5
Python       93.5   96.5
R            74.3   84.8
Ruby         78.9   76.2

In [27]:
twoyear['2015']

C              99.9
C#             91.3
C++            99.4
Java          100.0
JavaScript     83.0
Matlab         72.4
PHP            84.5
Python         96.5
R              84.8
Ruby           76.2
Name: 2015, dtype: float64

In [29]:
twoyear['avg'] = (twoyear['2014'] + twoyear['2015']) * (1/2)

In [30]:
twoyear

             2014   2015     avg
C            99.3   99.9   99.60
C#           92.4   91.3   91.85
C++          95.5   99.4   97.45
Java        100.0  100.0  100.00
JavaScript   84.5   83.0   83.75
Matlab       72.8   72.4   72.60
PHP          84.8   84.5   84.65
Python       93.5   96.5   95.00
R            74.3   84.8   79.55
Ruby         78.9   76.2   77.55

In [34]:
twoyear.loc['Python']

2014    93.5
2015    96.5
avg     95.0
Name: Python, dtype: float64

In [36]:
twoyear.loc['Java':'PHP']

             2014   2015     avg
Java        100.0  100.0  100.00
JavaScript   84.5   83.0   83.75
Matlab       72.8   72.4   72.60
PHP          84.8   84.5   84.65

In [40]:
twoyear.iloc[2:6]

             2014   2015     avg
C++          95.5   99.4   97.45
Java        100.0  100.0  100.00
JavaScript   84.5   83.0   83.75
Matlab       72.8   72.4   72.60

In [ ]:
	DOB	Education	Profile	Salary
Mohan	1980	MSc	Medical Representative	60000
Das	1985	MBA	Manager	65000
Karam	1990	MBA	Auditor	42000
Chand	1970	MA	Professor	75000
Gandhi	1995	BSc	Technician	68000

In [56]:
salaryinfo = pd.DataFrame([{'Name':'Mohan', 'DOB':1980, 'Education':'MSc', 'Profile':'Medical Representative', 'Salary':60000},
                           {'Name':'Das', 'DOB':1985, 'Education':'MBA', 'Profile':'Manager', 'Salary':65000},
                           {'Name':'Karam', 'DOB':1990, 'Education':'MBA', 'Profile':'Auditor', 'Salary':42000},
                           {'Name':'Chand', 'DOB':1970, 'Education':'MA', 'Profile':'Professor', 'Salary':75000},
                           {'Name':'Gandhi', 'DOB':1995, 'Education':'BSc', 'Profile':'Technician', 'Salary':68000}])

In [57]:
salaryinfo

    DOB Education    Name                 Profile  Salary
0  1980       MSc   Mohan  Medical Representative   60000
1  1985       MBA     Das                 Manager   65000
2  1990       MBA   Karam                 Auditor   42000
3  1970        MA   Chand               Professor   75000
4  1995       BSc  Gandhi              Technician   68000

In [58]:
salaryinfo.set_index('Name')

         DOB Education                 Profile  Salary
Name
Mohan   1980       MSc  Medical Representative   60000
Das     1985       MBA                 Manager   65000
Karam   1990       MBA                 Auditor   42000
Chand   1970        MA               Professor   75000
Gandhi  1995       BSc              Technician   68000

In [60]:
salaryinfo

    DOB Education    Name                 Profile  Salary
0  1980       MSc   Mohan  Medical Representative   60000
1  1985       MBA     Das                 Manager   65000
2  1990       MBA   Karam                 Auditor   42000
3  1970        MA   Chand               Professor   75000
4  1995       BSc  Gandhi              Technician   68000

In [61]:
si = salaryinfo

In [62]:
si

    DOB Education    Name                 Profile  Salary
0  1980       MSc   Mohan  Medical Representative   60000
1  1985       MBA     Das                 Manager   65000
2  1990       MBA   Karam                 Auditor   42000
3  1970        MA   Chand               Professor   75000
4  1995       BSc  Gandhi              Technician   68000

In [63]:
si.set_index('Name', inplace=True)

In [64]:
si

         DOB Education                 Profile  Salary
Name
Mohan   1980       MSc  Medical Representative   60000
Das     1985       MBA                 Manager   65000
Karam   1990       MBA                 Auditor   42000
Chand   1970        MA               Professor   75000
Gandhi  1995       BSc              Technician   68000

In [65]:
salaryinfo.set_index('Name')

KeyError: 'Name'

In [66]:
# Error Because of Copy
salaryinfo

         DOB Education                 Profile  Salary
Name
Mohan   1980       MSc  Medical Representative   60000
Das     1985       MBA                 Manager   65000
Karam   1990       MBA                 Auditor   42000
Chand   1970        MA               Professor   75000
Gandhi  1995       BSc              Technician   68000

In [67]:
si.set_index('DOB', inplace=True)

In [68]:
salaryinfo

     Education                 Profile  Salary
DOB
1980       MSc  Medical Representative   60000
1985       MBA                 Manager   65000
1990       MBA                 Auditor   42000
1970        MA               Professor   75000
1995       BSc              Technician   68000

In [70]:
salaryinfo.columns

Index(['Education', 'Profile', 'Salary'], dtype='object')

In [71]:
si

     Education                 Profile  Salary
DOB
1980       MSc  Medical Representative   60000
1985       MBA                 Manager   65000
1990       MBA                 Auditor   42000
1970        MA               Professor   75000
1995       BSc              Technician   68000

In [72]:
si.reset_index

<bound method DataFrame.reset_index of      Education                 Profile  Salary
DOB
1980       MSc  Medical Representative   60000
1985       MBA                 Manager   65000
1990       MBA                 Auditor   42000
1970        MA               Professor   75000
1995       BSc              Technician   68000>

In [73]:
si

     Education                 Profile  Salary
DOB
1980       MSc  Medical Representative   60000
1985       MBA                 Manager   65000
1990       MBA                 Auditor   42000
1970        MA               Professor   75000
1995       BSc              Technician   68000

In [74]:
salaryinfo = pd.DataFrame([{'Name':'Mohan', 'DOB':1980, 'Education':'MSc', 'Profile':'Medical Representative', 'Salary':60000},
                           {'Name':'Das', 'DOB':1985, 'Education':'MBA', 'Profile':'Manager', 'Salary':65000},
                           {'Name':'Karam', 'DOB':1990, 'Education':'MBA', 'Profile':'Auditor', 'Salary':42000},
                           {'Name':'Chand', 'DOB':1970, 'Education':'MA', 'Profile':'Professor', 'Salary':75000},
                           {'Name':'Gandhi', 'DOB':1995, 'Education':'BSc', 'Profile':'Technician', 'Salary':68000}])

In [76]:
salaryinfo.set_index('Name', inplace=True)

In [77]:
salaryinfo

         DOB Education                 Profile  Salary
Name
Mohan   1980       MSc  Medical Representative   60000
Das     1985       MBA                 Manager   65000
Karam   1990       MBA                 Auditor   42000
Chand   1970        MA               Professor   75000
Gandhi  1995       BSc              Technician   68000

In [78]:
salaryinfo.reset_index()

     Name   DOB Education                 Profile  Salary
0   Mohan  1980       MSc  Medical Representative   60000
1     Das  1985       MBA                 Manager   65000
2   Karam  1990       MBA                 Auditor   42000
3   Chand  1970        MA               Professor   75000
4  Gandhi  1995       BSc              Technician   68000

In [79]:
salaryinfo.set_index('DOB')

     Education                 Profile  Salary
DOB
1980       MSc  Medical Representative   60000
1985       MBA                 Manager   65000
1990       MBA                 Auditor   42000
1970        MA               Professor   75000
1995       BSc              Technician   68000

In [80]:
salaryinfo.reset_index

<bound method DataFrame.reset_index of          DOB Education                 Profile  Salary
Name
Mohan   1980       MSc  Medical Representative   60000
Das     1985       MBA                 Manager   65000
Karam   1990       MBA                 Auditor   42000
Chand   1970        MA               Professor   75000
Gandhi  1995       BSc              Technician   68000>

In [81]:
salaryinfo

         DOB Education                 Profile  Salary
Name
Mohan   1980       MSc  Medical Representative   60000
Das     1985       MBA                 Manager   65000
Karam   1990       MBA                 Auditor   42000
Chand   1970        MA               Professor   75000
Gandhi  1995       BSc              Technician   68000

In [83]:
salaryinfo['DOB']   # Does not Work - Wrong Code

Name
Mohan     1980
Das       1985
Karam     1990
Chand     1970
Gandhi    1995
Name: DOB, dtype: int64

In [84]:
dob = salaryinfo['DOB']

In [85]:
dob

Name
Mohan     1980
Das       1985
Karam     1990
Chand     1970
Gandhi    1995
Name: DOB, dtype: int64

In [86]:
dob['Karam']

1990

In [88]:
salaryinfo['DOB']['Karam']

1990